Repository: akshaydoshi2/offline-first-task-management-app
Catalog: lib/l10n/app_*.arb
Languages: sw

source: Task Manager
sw: Msimamizi wa Kazi

source: Your Task Manager
sw: Msimamizi wako wa kazi

source: Logout
sw: Toka

source: Add
sw: Ongeza

# enterPhoneNo
source: Enter Phone Number
sw: Ingiza Namba ya Simu

# enterValidPhoneNo
source: Enter a Valid Phone Number
sw: Weka nambari halali ya simu

source: Login
sw: Ingia

source: Submit
sw: Tuma

source: Create a task
sw: Unda Kazi

source: Create task
sw: Unda Kazi

source: Update task
sw: Sasisha Kazi

source: Enter Task Title
sw: Ingiza Kichwa cha Kazi

# enterTaskDesc
source: Enter Task Description
sw: Ingiza Maelezo ya Kazi

# selectDate
source: Select Task Date (Optional)
sw: Chagua Tarehe ya Kazi (Hiari)

# selectTime
source: Select Task Time (Optional)
sw: Chagua Muda wa Kazi (Hiari)

source: Online
sw: Mtandaoni

source: Offline
sw: Nje ya Mtandao

source: Done
sw: Imekamilika

source: UnDone
sw: Haijakamilika

source: Edit
sw: Hariri

source: Delete
sw: Futa

source: Add Tasks to Continue!
sw: Ongeza Majukumu Ili Kuendelea!

source: Something Went Wrong!
sw: Jambo Lililoenda Vibaya!

source: Title Required
sw: Kichwa Kinahitajika

# descRequired
source: Description Required
sw: Maelezo Yanahitajika

source: Are you sure?
sw: Je, una uhakika?

# areYouSureDelete
source: Are you sure you want to delete this task?
sw: Je, una uhakika unataka kufuta kazi hii?

source: Cancel
sw: Ghairi

source: Last Synced:
sw: Mara ya Mwisho Kulandanishwa:

# syncAborted
source: No Network Found! Sync Aborted!
sw: Hakuna Mtandao Ulio Patikana! Ulandanishaji Umeahirishwa!

# syncInitiated
source: Network Sync Initiated
sw: Ulandanishaji wa Mtandao Umeanzishwa

# syncComplete
source: Network Sync Completed on
sw: Ulandanishaji wa Mtandao Umekamilika tarehe
